Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases
The electrical connected phases of an electrical analytical node.

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.ABCN
Phase ABCN

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.ABC
Phase ABC

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.CAN
Phase CAN

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.BCN
Phase BCN

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.ABN
Phase ABN

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.CA
Phase CA

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.BC
Phase BC

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.AB
Phase AB

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.CN
Phase CN

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.BN
Phase BN

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.AN
Phase AN

Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases.Invalid
The invalid state, no text field. It does not shown on UI and API.